:PROPERTIES:
:ID:       f435fad4-d094-47c4-a764-4eb120d5584e
:END:
#+title: Rust macros

** COMMENT code examples
#+begin_src jupyter-rust :session affff
use proc_macro::TokenStream;

#[proc_macro]
pub fn foo(input: TokenStream) -> TokenStream {
    dbg!(input)
}

fn main() {
    foo!(x + y)

}
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
:     foo!(x + y)
: [91m    ^^^[0m [94m[0m
: can't use a procedural macro from the same crate that defines it
# [goto error]
: #[proc_macro]
: [91m^^^^^^^^^^^^^[0m [94m[0m
: the `#[proc_macro]` attribute is only usable with crates of the `proc-macro` crate type
# [goto error]
: use of undeclared crate or module `proc_macro`
: unresolved import `proc_macro`
:END:
